from colorama import Fore, Back, init
init()

theme1 = f'''
1
{Fore.BLUE + 'Информация'}{Fore.RESET} - любая совокупность данных ( вводные данные), выводящая в окр среду (исхо-дящах инфа), сохраняющая в опр ио-ке

{Fore.BLUE + 'Свойства информации: '}{Fore.RESET}полнота,актуальность,достоверность,релевантность,защищенность,эргономичность

{Fore.BLUE + 'кол-во инфы (вес)'}{Fore.RESET}
{Fore.GREEN} 
1 байт- 8бит
1 Килобайт- 1024 байта
1. Мегабайт - 1024 кб
1 Шгабайт - 1024 мб
1 терабайт-1024 б
1 петабайт - 1024 тб
1 эксабойт- 102ч Пб
1 зептабойт- 1024эб
1 Йоттабайт -1024 зб
{Fore.RESET}
{Fore.BLUE + 'Инф процессы.'}{Fore.RESET}
- процессы, связанные с хранением, передачей, получением, обработкой инфы.

{Fore.CYAN + 'Информация в разных сферах отличими имо-ет разную трактовку'}{Fore.RESET}

{Fore.BLUE + 'Tрaдиционый (используется в информатике)'}{Fore.RESET}-
сведения, знания и т.п, что человек получает из жизни с помощь органов чувсть.

{Fore.LIGHTRED_EX + 'Верoятностный - испотльзуется в теории'}{Fore.RESET}
о инфе-информация - это сведения об объектах, явлениях окр среды, их пара-метрах, св-вах, состоянию, которые уменьши ют имеющуюса о них степень неопр и неполноты знаний

{Fore.BLUE + 'Классификация инфы:'}{Fore.RESET}
визуальная
обонятельная
аудиальная (звуки) вкусовая тактильная 

{Fore.BLUE + 'По формам представления'}{Fore.RESET}
текстовая числовах графическая музыкальнах комьинированная

{Fore.BLUE + 'По общественному значению'}{Fore.RESET}
{Back.LIGHTGREEN_EX}{Fore.BLACK}массовая
специальная
Личная 
Информационные объекты в повседневной жизни
тексты таблицы
• рисунки фотки
Графы
графики схемы
эл. таблицы
базы данных звуки и виделизображение
веб-странцы
презентации и др{Fore.RESET}
{Back.RESET}'''

theme2 = f'''2
{Fore.BLUE + 'Состав компа'}{Fore.RESET}
{Fore.GREEN}блок питания оперативка (ОЗУ)
Материнка
процессор SCPU
жёсткий диск (Ндд
звуковая платы дисководы (сиди,дивиди
Сетевая и звуковая платы
{Fore.RESET}
{Fore.BLUE + 'Процессор'}{Fore.RESET} - микросхема для высолени-операционных . Мозг компа

{Fore.LIGHTRED_EX + '• Видеокарта '}{Fore.RESET}- картинка

{Fore.LIGHTGREEN_EX + 'оперативка '}{Fore.RESET}- одна несколько планик на материнке (DDR). Оперативка нужна для скорой работы с временными данными во время кользованих компом.

{Fore.MAGENTA + 'HDD постоянное хранилище'}{Fore.RESET} данных ста-кими данными могут быть: пользовательс-кие, временные, системные

{Fore.BLUE + 'DVD'}{Fore.RESET} лоток выдвижной для установ-
ки дисков чтоb считывать инфу с них

{Fore.CYAN + 'Монитор '}{Fore.RESET}- экран. устр-во вывора

{Fore.LIGHTYELLOW_EX + 'Клава '}{Fore.RESET}- успр-во ввода. Вводинфы) оборие

{Fore.BLUE + 'Мышь'}{Fore.RESET} - для перемещения курсора.'''

theme3 = f'''
3
{Fore.BLUE + 'Кодирование'}{Fore.RESET} - перевод инфы в другую форму посредством видоизменения некоторым Кодом ( для передачи, обработки, хранения)

{Fore.MAGENTA + 'Система счисления'}{Fore.RESET} - способ наименования о обозначения чисел

{Fore.LIGHTBLUE_EX + 'Есть позиционная'}{Fore.RESET}(десятична, двоичная и тп
{Fore.LIGHTRED_EX + 'И непозиционная'}{Fore.RESET} (римские цифры)'''

theme5 = f'''5
{Fore.BLUE + 'Комп сеть '}{Fore.RESET}- система компьютеров, связанных каналами передачи для обмена информацией

{Fore.MAGENTA}Компьютерные сети. По распространенности
сети{Fore.RESET}
локальные региональные глобальные


{Fore.BLUE + 'По принадлежности'}{Fore.RESET}
{Fore.GREEN}• семенные
• гос-ные
- домовые
международные
• корпоративные
• ведомственные{Fore.RESET}

{Fore.LIGHTYELLOW_EX + 'По передаче'}{Fore.RESET}
• низкоскоростные до 20 мбит/
• высокоскоростные > 100Мбит/с
• среднескоростные до 10 кбит/с

{Fore.LIGHTCYAN_EX + 'По типу среды передачи'}{Fore.RESET}
• телефонные
• бытовые электрические
• коаксиальные
• На виток паре
• по радио каналам (Wifi; блат)
• оптоволоконные
, в инфракрасном диапазоне

{Fore.BLUE + 'Топология сети'}{Fore.RESET} - общая схема соединения компов

{Fore.YELLOW + 'Типы соединения'}{Fore.RESET}
Шина
Ячеситая
Звезда
Кольцо'''



theme7 = f'''7
{Fore.BLUE + 'Схд(системы хранения данных)'}{Fore.RESET}
• централизация инды
• Надёжная защита инфы
• ускоренная обработка
• расширение дисковых ёмкостей
• утилизация ресов
• упрощённое управление инф. готоками
• повышение экономич эффекте внурения ИС

{Fore.CYAN + 'СХД'}{Fore.RESET} - спец оборудование и ПО для хранения
Инфы,

{Fore.MAGENTA + 'SSD : Достоинства'}{Fore.RESET}
- быстрый доступ
- тихая работа
- низкое энергопотребление
- механич надежность
- климатоустоливость (перегреви .П)
- - низкие вес и размеры

{Fore.LIGHTRED_EX + 'Недостатки'}{Fore.RESET}
- высокая цена - огранич колво циклов
- меншая емкость записи
- уязвимость к молнитным —
полям

{Fore.BLUE + 'Сетевое хранение данных (SAN)'}{Fore.RESET}
служит для подключ внеш ус-ств к серверам так, что данные из сетевых становятся локальными

{Fore.LIGHTGREEN_EX + 'позволяет озеспечить'}{Fore.RESET}
* синхронизация с др усвоми
* горячее подключ ковсему остальному
* разрузка основной сети
* оперативный и назежный доступ
* уск-ный процесс резервного коп-ния и высы.
данных.

{Fore.MAGENTA + 'сетевое дисковое хран. дных. '}{Fore.RESET}
цель-упростить доступ к инфе, работа с фолами и не с блоками файлов разру-ка объёма помяти

{Fore.BLUE + 'Для чего нужно'}{Fore.RESET}
* простое комплективное гоз-ние ресов
* доступность до для всех ус-тв
* простота развёртывания и администр
* унаверсальность

{Fore.YELLOW + 'Недостатки:'}{Fore.RESET}
* доступ через протоколы (медленно)
* дешевые сервера дают медленную эксплуатацию д-ных'''

theme8 = f'''8   
{Fore.BLUE + 'Информационная безопасность'}{Fore.RESET}
• - сов-сть мер по защите инф. среды общ-ва и человека.

{Fore.CYAN + 'Инф угрозы'}{Fore.RESET}
Преднамеренные
- Хищение инфи
- вирусы
- физ возд на аппаратуру

{Fore.GREEN + 'Случайные'}{Fore.RESET}
• Ошибки юзера, программирования
• Форсмажорные обстоятельства

{Fore.LIGHTMAGENTA_EX + 'Уровни соблюдения Инфо безопасности :'}{Fore.RESET}
законодательный; морально-этический; административный,; физ.;
Аппаратно-программный

{Fore.RED + 'Комп. вирус'}{Fore.RESET}
- целенаправленно созданняя програм-ма, которая указывает в своих данных, что это др. прог. продукт и уничтожает ПО

{Fore.BLUE + 'Классификация вирусов'}{Fore.RESET}
{Fore.CYAN}•По среде"
обитання{Fore.RESET}
{Back.GREEN + ''}{Fore.RESET}* по ст возд
* по способам заражения
* по алгоритмическим особенностям построения
1 - загрудочные фоловые, гибриды 2 и 1.
сетевые, системные
2 - неопасные оласные, очень опасные
3 - резидентные), нерещидентные
4- репликаторные, троянский конь, логическая болба, мутанты, невидимни, мескровирусы,{Back.RESET}

{Fore.LIGHTYELLOW_EX + 'для обнаружении, удаления, защиты от комп вирусов разработаны антивирусы, кктиверусные программы.'}{Fore.RESET}'''

theme9 = f'''
{Fore.BLUE + 'Microsoft WoRD '}{Fore.RESET}- тексковый процес-сор, предназнач для создания, просмонра "
редактировании txt доков с локальным изменением простейших форм таблично-матричных алгоритмов.'''

theme10 = f'''10
{Fore.BLUE + 'Комп-графика'}{Fore.RESET} - раздел информатики, изу-чатций средства и способы создания и оброботки графических изображений при помощи комп. техники

{Fore.GREEN}растровая (точка ) 2д
Векторная (линии) 2 д фрактальная (треугальник) 2 д
трехмерная (плоскость) зд{Fore.RESET}

{Fore.LIGHTMAGENTA_EX + 'Особенности растровой графики'}{Fore.RESET}
• изображение будет казаться настоящим
• при увеличении происходит искажение пикселей
• легко редакировать изоб.
• много весит

{Fore.YELLOW + 'Характеристики растровой графики'}{Fore.RESET}
• Разрешение изображения - опр. чёткость Изоб-ния, выражается в точках на дюйм
• Разрешение дисплея - степень резкости изоб-ния на дисплее. Измеряется в точками на дюйм
• Разрешение при печати - выражаета в как-ве чернильных частиц, которые можно распы-. лить на дойм бумаги.

{Fore.BLUE + 'Векторный метод'}{Fore.RESET} - представлечется линиями, менее реалистичен, описывает изоб-ния этрезками И мениями имеющим свои корды и расположение, цвета.
 
{Fore.GREEN + 'Достоинства'}{Fore.RESET}
кач-во изоб-ния не меняется при
увіличении
• меньший объём памяти, занимений ка компе, хранятся оснные у ные, ко которым изобние рисуется каждый раз

{Fore.LIGHTRED_EX + 'Недостатки'}{Fore.RESET}
• Сохраняется в своём собственном формате
• не предназначена для создания реалистичных изобний

{Fore.BLUE + '• Фрактальная Графика'}{Fore.RESET} - бывает и секторной и растровой. - эна вычисля
емоя. хранится в форме уравіений
на компе, ко котым строится щоб-нио.

{Fore.LIGHTGREEN_EX + '• Зд графеска '}{Fore.RESET}- Максимально соотвелетвути реальности, можно рассматривать объекты со всех сторо используются фигуры и различные клосности и фигуры

{Back.YELLOW}{Fore.BLACK}Осн-ные понятия
• разрешение изобния - в dpi
• физо размер в пикселях и в единицах измерения по Хи у оси
комп
• глубина цвета -кол-во бит для кодирования 1-ого пихеля
цветков
• Цветовая модель-спосот разделения на компоненты{Fore.RESET}{Back.RESET}'''

theme12 = f'''12
{Fore.BLUE + 'Моделирование'}{Fore.RESET} - замена одного объекта другим, но сохран. все существенные св ва исхрдного объекта.

{Fore.CYAN + '• Модель'}{Fore.RESET} -Аналоговая версия оригинала,
отражает нек- рые характеристики.

{Fore.LIGHTRED_EX + 'Модельное представление '}{Fore.RESET}- способ обрабомки
человеком окр. среды

{Fore.MAGENTA + 'По области юзания'}{Fore.RESET}
• Учебные ( пособия
• Опытные (ГЭС, возохранимице)
• Научно технические синхротрон)
• Игровые
• Имитационные (Икро из водорослей)

{Fore.YELLOW}Классификация моделей
по способу представления.{Fore.RESET}

{Back.LIGHTYELLOW_EX}{Fore.BLACK}Материальные;
• внеш св-ва объектов
• внутр устрово
• суть объекта{Fore.RESET}
{Back.RESET}
{Fore.BLUE + 'Информационные'}{Fore.RESET}
- компные
- и не компные

{Fore.CYAN + '- • Геом-ские'}{Fore.RESET}
• Матем-кие
з • Словесные
• спец модели
* материальные

{Fore.LIGHTMAGENTA_EX + 'Инфо модель'}{Fore.RESET} - модель, представл объект,
процесс или явл, которое представляет все набором связей между параметрами

• {Fore.GREEN + 'Мат. модель'}{Fore.RESET} - Инф модель, в которой параметры и в зависимости от мат. формы,они выражены по-разкому'''

theme14 = f'''14
{Fore.BLUE + 'Алгоритм'}{Fore.RESET} - система точных и понятных предписаний уля решених задачи, исп может быль человек,

{Fore.CYAN + 'Систама команд исполнителя (СКИ). '}{Fore.RESET}- Набор действий, котые может совершить Исполнитель

{Fore.LIGHTMAGENTA_EX + 'Св-ва алгоритма'}{Fore.RESET}
• дискретность - прерывистость, конкретное разделение между д-виями
• детерминированность - чёткое, не двухмысленно указание.
• конечность
• результативность
• Массовость многоднивериальность, гибкость

{Fore.GREEN + 'Тиловые конструкции алгоритмов.'}{Fore.RESET}
• линейный
• циклический
• разветвляющийся
• вспомогательный

{Fore.LIGHTRED_EX + 'Способы описания алгоритмов.'}{Fore.RESET}
• на ест. нам языке
• на слец (формальном) языке
• формулы, таблицы рисунки
• стандартные графические объекты'''

theme15 = '''15
БД - хранилище д-ных о некоторой предметной обл., организованное в виде структуры

Задачи
• Обеспечение хражения в бд
Система управления од (СУБД)-тогр обе По для работы с б Д.
ф-цик:
• создание бд
• конск инфы в Б Д
• выполнение простых расчётов
• вывод эмчётов на печать
• ред. БД

Типы бд
1 табличные
2 запутанные
3 иерархические
4 реляционные

Глав. ключ- поле, опр запись, которая
есть только в ед.ч. порядковый намер. её.

Связи между таблицами (внеш, ключ)
Ms Access рабожает с
• таблицами
• формами
• запросами
• отчётами
• макросами
• модулями

• Форма - объект ввода вывози, упрове-ния работой приложения. позволяет запускать макросы либо процедуры Viscal Boc.
внем,
• Отчеты - позволяет форматировать, вычислят, пеЧатать, обоящать выбранные д ные (CRUD)
Запрост позволяет настроить аттрс выводимых данных (Select) 
Страницы - позволятт публиковать д-ные с бд в сети интернета

Модуль - содержит пользовательские проци с языка Visual Bas ic. Медули обеспечит
выполнение ф-ций из лю. места

Макрос-скруктурированное описание двий
при даче укозаний

Типы д нык, котые в Access
Text
поле МеМО

Data tine
Счётчики
поле объекта OLe
Логический (booL)'''

theme16 = f'''16
{Fore.BLUE + 'Matplotlib'}{Fore.RESET} - либа для визуализации 2д и 3д данных'''

theme24 = f'''24
{Fore.BLUE + 'И.И'}{Fore.RESET} - наука создания интеллектуальных машин, комп. программ. Сьязан с задачей юзания компов дла понимания чел. интеллекто

{Fore.GREEN + 'цели ИИ:'}{Fore.RESET}
• реализация человека компьтером
• Создание экспертных сис.- демонструуют разумное-поведение.

{Fore.MAGENTA + 'Его использование:'}{Fore.RESET}
• Игры
• расрознование текста
• прогнозирование

{Fore.CYAN + 'В 80-х появились 1ые ии тренажёры для образования'}{Fore.RESET}

{Fore.LIGHTRED_EX + 'Осн. напр И.И.:'}{Fore.RESET}
• разработка сис, базирующина на знаниях,
• Зенерация и распознование речи
• Абучение и самообучение
• Обработка визуальной инфы
• Рослазнавание образов
• Интел. роботы

{Fore.BLUE + 'Разработка сис, осн. На знания.'}{Fore.RESET}
• Имитация сп-тей чела в слабострктурированных и неспруктурированных знаниях
- Визуал. комощники (Siri, миса)
- Автомобили с (testa
- предложения товаров
- обнаружение мошенничества
- Видеонаблюдение

{Fore.LIGHTYELLOW_EX}Обучение и самообучение
Дата-майнинг автогенерация данных{Fore.RESET}

{Fore.CYAN + 'Обработка визуальной инфы.'}{Fore.RESET}
Анализ, синтез рng. Они переходят в др мил д-ных. Юзаются алго построения инфы, на выходе идут графич. объекты.

{Fore.MAGENTA + 'Интел, роботы.'}{Fore.RESET}
развивается оч. бурно, космич сфера мед. роботы'''

theme25 = f'''25
{Fore.BLUE + 'Машинное обучение '}{Fore.RESET}- суть в том, чтобы ИИ не только довал требуемых рез-т, но и обучался выполнять поставленную задачу,
явл. ветвью ИИ

{Fore.CYAN + 'Обучение с учитилем: '}{Fore.RESET}
сущ. (Мн -во подборок - пар) „вопрос, ответ", есть зависимости м/у ним (оно неизвестна), на основе () должен
создасться алгоритм, слособный дать
самый точный ответ

{Fore.GREEN + '• Обучение без учителя:'}{Fore.RESET}
 изучает широкий класс д-ных и ищет соязи м) у д-ными

{Fore.MAGENTA + ''}{Fore.RESET}• Нейросеть - послед. нейронов, соедин, синапсами; это машинная интерпретация человеческого мозга. в этом случае мат. Функ
{Fore.LIGHTRED_EX + 'Синапс'}{Fore.RESET}- нейрон чел. мозга, по которым агрегирует-ся информация и по ее алгоритму выдае-ся рез-т.

{Fore.YELLOW + '• Метод опорных векторов:'}{Fore.RESET} особым св ви выступает уменьшение эмпрической оши-ки классификации и увеличение зазора
{Back.MAGENTA}{Fore.BLACK}Алгорити работет по принципу: чем больше розница м/у парал. гиперпл-тями,
тем точнее ответ классификатора{Fore.RESET}{Back.RESET}

{Fore.BLUE + '• бустинг'}{Fore.RESET} - процедура построения композици алгоритмов машинного обучения, суть в том, чтобы компенсировать погрешности пр.вариантов'''

theme27 = f'''27
{Fore.BLUE + 'Регрессия'}{Fore.RESET} - функ зав-ть М/у пр-ними а усл. МО(мат. Ожид), зав п-ной, котая строится с целью предсказания этого ср. зн при фиксированных зн (регрессеров)

{Back.YELLOW}{Fore.BLACK}мн-в-ная. ли. рогрессиа.
= a0 +a1x1i + a2x2i +..+akxki+ Epsilon i{Fore.RESET}{Back.RESET}

{Back.CYAN}{Fore.BLACK}парн. Лин. регрессия
ん
yi = a0 + а1xi + Epsilon i{Fore.RESET}{Back.RESET}

{Fore.LIGHTMAGENTA_EX + 'Причины вознисновення Epsilon i'}{Fore.RESET}
1. не вклыч в уров ключевых факторов
2. огибки и трудности в измер.
3. неверный выбор функ. формы модели
4. агрегирование
5. непредсказуемость чел. фоктора
6. праниченность статистич д-ных, 

{Fore.LIGHTGREEN_EX}Очередность появл парам и п-ных
в регрессивных уравн:{Fore.RESET}
1. имеем n пар наблжений уi;Xi
2. Находим парамс уравн а0;а1
3. Находин теоретич зн. зав-мой п-ной у ~Y
4. Находим зн. случ. члена Еi = уi и ~Yi

{Fore.YELLOW + 'Ограниченность (парной лин. регрессий).'}{Fore.RESET}
1. ни одна независ п-ная не мож „кач-но" отразить изм. зав. п-ной,
2 ,бесть группа п-ных, котые одинаково
влиянт на незав п-ную, но противоречат друг другу.
3. лін. ф-ма связи примитивна

{Fore.BLUE + 'Нет ничего лучше по простоте, чем парная лин регрессия'}{Fore.RESET}

{Fore.CYAN + 'Сущность методов наим. Квадратов '}{Fore.RESET}- минемализация суммы квадратов отклонений фактич зн. , вычисл. по у-нию связи

{Back.MAGENTA}{Fore.BLACK}Формула методов квадратов
f(a0;a1) = n SIGMA i=1 (yi- ~Yi)^2 —> min

~Yi = a0+a1xi{Fore.RESET}{Back.RESET}

{Fore.GREEN + 'Св-ва оценок params регрессионного уравнения!'}{Fore.RESET}
1. Несмещенность (оценок params)
2. Состоятельность оценок params в.
Эффективность оценок парамс)
4. Достаточность оценки'''

theme28 = f'''28
{Fore.BLUE}Если входная переменная одна и она явл. Дискретной, она нужд. В кл-ции{Fore.RESET}

{Fore.MAGENTA + 'Виды классификации.'}{Fore.RESET}
* Вспомогательная
• Естественная - посущественным пр офарактеру
* Простая
• Сложная -делитая на разные основания рассм. .
• Многомернах - по 2 + кризнаков.
• Одномерная - по 1признаку

{Back.CYAN}{Fore.BLACK}Процесс Кл-ции
Цель процесса. в костроении модели с прогно-зкрующими attrs в кач-ве входных params,
получающей зн завис. attr.{Fore.RESET}{Back.RESET}

{Fore.GREEN + 'Процесс кл-ции: мнво обj бьётся на классы по опр. Param'}{Fore.RESET}

{Fore.YELLOW + 'Классификатор '}{Fore.RESET}- сущность, опр. Откуда исходит оbj по вектору призн.

{Fore.BLUE}для кл-ции кутём Мат. методов нужно. формальное описание оbj
Набор разбивают на обучающее и тестовое sets{Fore.RESET}

{Fore.LIGHTRED_EX + 'Обуч.'}{Fore.RESET} - имеет д-ные для обучения модели

{Fore.MAGENTA + 'Тестовое'}{Fore.RESET} - іnput и output зн. примеров для проверки работосп-ти модели.

{Fore.BLUE + 'Этапы кл-ций Конструирование'}{Fore.RESET}
модели.
• Конструирование Модели
*её юзание

{Fore.CYAN + 'Конструировани модели:'}{Fore.RESET}
* описание set предопр. классов
• один общий тип д-ных для set
• юз обуч. set
• Модель представлена Кл-ционными правилами, мат. ф-лами и деревом решении.

{Fore.LIGHTGREEN_EX}Бл –-> обуч, set → Кл-ционный алгоритм → модель —-> *выход*{Fore.RESET}

{Fore.MAGENTA + 'Использование модели'}{Fore.RESET}
Юз модели: кл-ция новых или неизв. д-ных
• неизв. зн сравн с д-ными получ модели
• ур. точности - правильно кл-цированные примеры в test set
• test set не зав от обуч. Set

{Fore.LIGHTYELLOW_EX + 'Если точность долустима, то можно юзать для неизв зн примеров эту модель дальше.'}{Fore.RESET}

{Fore.CYAN + 'Бд —-> Обуч. Set → кл-ный алго---> новые д-ные'}{Fore.RESET}

{Fore.BLUE + '- Методы кл-ции.'}{Fore.RESET}
лин. регрессия
д-во реш.
Нейросети'''

theme29 = f'''29
{Fore.BLUE + 'Деревья решений '}{Fore.RESET}- метод, позволятний предска-зывать зн. зав. п-ной в зав. от соотв. зн. одной или неско независ, п-ных.

{Fore.CYAN + 'Правила разбиения:'}{Fore.RESET}
1) Вектор содержит в инпуте порядковые и категориальные п-ные
2) в узле разбиение идёт по одной п-ной

{Fore.LIGHTMAGENTA_EX + 'Правило остановки'}{Fore.RESET}
• (min-sa mples-split) - мин. Число объектор при котором выполняется расщепление
• min-samples_ leaf - мин число объекти
в листьях
• Доля неклассифицированных
• (Max_depth) - макс. глубина. '''

theme30 = f'''30
{Fore.BLUE + 'Класт-ция '}{Fore.RESET}- процесс организации на группу обj, похожих в нек-ом роде.

{Fore.CYAN + 'Кластер'}{Fore.RESET} - гр. Похожих обj.

{Fore.YELLOW}разница класт-ции и кл-ции закл. в методах обучения...{Fore.RESET}

{Fore.LIGHTWHITE_EX+ '2 вида класт-ции. .'}{Fore.RESET}
{Fore.MAGENTA+ '1жёсткая'}{Fore.RESET}
{Fore.LIGHTRED_EX + '2 мягкая'}{Fore.RESET}
{Fore.MAGENTA + '1.'}{Fore.RESET} - при ней каждый элт data s et принадлежит только однаму кластеру
{Fore.LIGHTRED_EX + '2'}{Fore.RESET} - при ней - неск-ким

{Fore.YELLOW}• Кач-во класт-ции привязано к специфике задачи, выражается в виде целевой дАции.
(кот-ую либо mах(), либо тmin()»{Fore.RESET}

{Fore.BLUE + 'Сферы юза класт-ции:'}{Fore.RESET}
• Маркетинг
• Биология
• Сферы услуг и т.п.

{Fore.CYAN + 'Проблемы класт-ции.'}{Fore.RESET}
• не все методы класт-ции могут учитывость св-ва attrs кластеризируемых обj
• проблема с методами расст, котое м. б, неоднозначно.
• рез-ты кластеризации трактуются многовариативно
- нормализация зн. attrs obj . - фактор, из-за кот-го рез-ты варьируются, подра-зумевает приведение к общей ед-це изм.'''

keys_themes = {'1': theme1, '2': theme2,
               '3': theme3, '5': theme5,
               '7': theme7, '8': theme8,
               '9': theme9, '10': theme10,
               '12': theme12, '14': theme14,
               '15': theme15, '16': theme16,
               '24': theme24, '25': theme25,
               '27': theme27, '28': theme28,
               '29': theme29, '30': theme30}

search_words = {'информатика': keys_themes['1'],
                'комп': keys_themes['2'],
                'кодирование': keys_themes['3'],
                'сети': keys_themes['5'],
                'схд' or 'хранение данных': keys_themes['7'],
                'информационная безопасность': keys_themes['8'],
                'ворд': keys_themes['9'],
                'графика': keys_themes['10'],
                'моделирование': keys_themes['12'],
                'алгоритм': keys_themes['14'],
                'бд': keys_themes['15'],
                'матплотлиб': keys_themes['16'],
                'ии': keys_themes['24'],
                'маш обучение': keys_themes['25'],
                'регрессия': keys_themes['27'],
                'классификация': keys_themes['28'],
                'деревья': keys_themes['29'],
                'кластеризация': keys_themes['30']}
